       01  ANSCOMBE.
           05  X123   PIC S999.99.
           05  FILLER PIC X.
           05  Y1     PIC S999.99.
           05  FILLER PIC X.
           05  Y2     PIC S999.99.
           05  FILLER PIC X.
           05  Y3     PIC S999.99.
           05  FILLER PIC X.
           05  X4     PIC S999.99.
           05  FILLER PIC X.
           05  Y4     PIC S999.99.
